; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p17)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 - Aircraft
 c1 c2 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 p18 p19 p20 p21 p22 p23 p24 p25 p26 p27 p28 p29 p30 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c1)
(at p1 c2)
(at p2 c2)
(at p3 c2)
(at p4 c1)
(at p5 c2)
(at p6 c2)
(at p7 c1)
(at p8 c1)
(at p9 c1)
(at p10 c2)
(at p11 c2)
(at p12 c1)
(at p13 c2)
(at p14 c1)
(at p15 c2)
(at p16 c2)
(at p17 c1)
(at p18 c1)
(at p19 c2)
(at p20 c2)
(at p21 c1)
(at p22 c2)
(at p23 c1)
(at p24 c2)
(at p25 c1)
(at p26 c1)
(at p27 c2)
(at p28 c1)
(at p29 c1)
(at p30 c2)
)
(:goal (and
(at a1 c1)
(at p1 c2)
(at p2 c1)
(at p3 c1)
(at p4 c1)
(at p5 c1)
(at p6 c1)
(at p7 c1)
(at p8 c1)
(at p9 c1)
(at p10 c1)
(at p11 c2)
(at p12 c1)
(at p13 c2)
(at p14 c2)
(at p15 c2)
(at p16 c1)
(at p17 c1)
(at p18 c1)
(at p19 c1)
(at p20 c2)
(at p21 c1)
(at p22 c1)
(at p23 c1)
(at p24 c1)
(at p25 c2)
(at p26 c1)
(at p27 c2)
(at p28 c2)
(at p29 c2)
(at p30 c2)
))
)

; plan
1. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 17 of 31
2. (board p2 a1 c2)
   deleted: (at p2 c2)
   added: (in p2 a1)
   goals met: 17 of 31
3. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 18 of 31
4. (debark p2 a1 c1)
   deleted: (in p2 a1)
   added: (at p2 c1)
   goals met: 19 of 31
5. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 19 of 31
6. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 18 of 31
7. (board p3 a1 c2)
   deleted: (at p3 c2)
   added: (in p3 a1)
   goals met: 18 of 31
8. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 19 of 31
9. (debark p3 a1 c1)
   deleted: (in p3 a1)
   added: (at p3 c1)
   goals met: 20 of 31
10. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 20 of 31
11. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 19 of 31
12. (board p5 a1 c2)
   deleted: (at p5 c2)
   added: (in p5 a1)
   goals met: 19 of 31
13. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 20 of 31
14. (debark p5 a1 c1)
   deleted: (in p5 a1)
   added: (at p5 c1)
   goals met: 21 of 31
15. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 21 of 31
16. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 20 of 31
17. (board p6 a1 c2)
   deleted: (at p6 c2)
   added: (in p6 a1)
   goals met: 20 of 31
18. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 21 of 31
19. (debark p6 a1 c1)
   deleted: (in p6 a1)
   added: (at p6 c1)
   goals met: 22 of 31
20. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 22 of 31
21. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 21 of 31
22. (board p10 a1 c2)
   deleted: (at p10 c2)
   added: (in p10 a1)
   goals met: 21 of 31
23. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 22 of 31
24. (debark p10 a1 c1)
   deleted: (in p10 a1)
   added: (at p10 c1)
   goals met: 23 of 31
25. (board p14 a1 c1)
   deleted: (at p14 c1)
   added: (in p14 a1)
   goals met: 23 of 31
26. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 23 of 31
27. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 22 of 31
28. (debark p14 a1 c2)
   deleted: (in p14 a1)
   added: (at p14 c2)
   goals met: 23 of 31
29. (board p16 a1 c2)
   deleted: (at p16 c2)
   added: (in p16 a1)
   goals met: 23 of 31
30. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 24 of 31
31. (debark p16 a1 c1)
   deleted: (in p16 a1)
   added: (at p16 c1)
   goals met: 25 of 31
32. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 25 of 31
33. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 24 of 31
34. (board p19 a1 c2)
   deleted: (at p19 c2)
   added: (in p19 a1)
   goals met: 24 of 31
35. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 25 of 31
36. (debark p19 a1 c1)
   deleted: (in p19 a1)
   added: (at p19 c1)
   goals met: 26 of 31
37. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 26 of 31
38. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 25 of 31
39. (board p22 a1 c2)
   deleted: (at p22 c2)
   added: (in p22 a1)
   goals met: 25 of 31
40. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 26 of 31
41. (debark p22 a1 c1)
   deleted: (in p22 a1)
   added: (at p22 c1)
   goals met: 27 of 31
42. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 27 of 31
43. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 26 of 31
44. (board p24 a1 c2)
   deleted: (at p24 c2)
   added: (in p24 a1)
   goals met: 26 of 31
45. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 27 of 31
46. (debark p24 a1 c1)
   deleted: (in p24 a1)
   added: (at p24 c1)
   goals met: 28 of 31
47. (board p25 a1 c1)
   deleted: (at p25 c1)
   added: (in p25 a1)
   goals met: 28 of 31
48. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 28 of 31
49. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 27 of 31
50. (debark p25 a1 c2)
   deleted: (in p25 a1)
   added: (at p25 c2)
   goals met: 28 of 31
51. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 29 of 31
52. (board p28 a1 c1)
   deleted: (at p28 c1)
   added: (in p28 a1)
   goals met: 29 of 31
53. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 29 of 31
54. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 28 of 31
55. (debark p28 a1 c2)
   deleted: (in p28 a1)
   added: (at p28 c2)
   goals met: 29 of 31
56. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 30 of 31
57. (board p29 a1 c1)
   deleted: (at p29 c1)
   added: (in p29 a1)
   goals met: 30 of 31
58. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 30 of 31
59. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 29 of 31
60. (debark p29 a1 c2)
   deleted: (in p29 a1)
   added: (at p29 c2)
   goals met: 30 of 31
61. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 31 of 31
